print(2022)  # 直接输出整数
print(3.14)  # 直接输出浮点数（带小数点的数）
print(1, 2, 3, 4, 5)  # 使用逗号连接要输出的数字，重甲使用空格连接 1 2 3 4 5
print(192, 168, 1, 1, sep='.')  # 使用间隔符，进行连接，数值之间用 . 进行分割
# -------------------------------------------------------------------------------
#  print('北京欢迎你' + 2022)  # 会报错  TypeError:
print('北京欢迎你' + ',' + '2022')
print('北京欢迎你'',' + '2022')
print('北京欢迎你'',''2022')
print('北京欢迎你,' + '2022')  # 同字符串就不会报错
# --------------------------------------------------------------------------------
print(range(5, 15, 3))  # range(5, 15, 3)
print(range(1 + 5, 15, 3))  # range(6, 15, 3)
print(list(range(1 + 5, 15, 3)))  # [6, 9, 12]
print(range(10))  # range(0, 10)
a = range(10)
print(a)


# >>>range(10)        # 从 0 开始到 9
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# >>> range(1, 11)     # 从 1 开始到 10
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# >>> range(0, 30, 5)  # 步长为 5
# [0, 5, 10, 15, 20, 25]
# >>> range(0, 10, 3)  # 步长为 3
# [0, 3, 6, 9]
# >>> range(0, -10, -1) # 负数
# [0, -1, -2, -3, -4, -5, -6, -7, -8, -9]
# >>> range(0)
# []
# >>> range(1, 0)
# []