# -*- coding: utf-8 -*-
# 1.初始化变量

answer = input('今天要上课吗？y/n:')
while answer == 'y':  # 2.条件判断
    print('学有所成')  # 3.语句块
    # 4.改变变量
    answer = input('今天要上课吗？y/n:')  # 注释掉这句直接死循环

# 1-100之间的累加和
i = 1  # （1） 初始化变量
s = 0  # （1） 初始化变量
while i <= 100:  # （2）条件判断
    s += i  # (3)语句块
    # （4）改变变量
    i += 1
print('1-100之间的累加和为:', s)

# while 和 else  结构
a = 1  # （1） 初始化变量
b = 0  # （1） 初始化变量
while a <= 100:  # （2）条件判断
    b += a  # (3)语句块
    # （4）改变变量
    a += 1
else:
    print('1-100之间的累加和为:', b)
